GopalSaraf/Practicals/PSDL/include/proc/pic16f19186.inc
// Register: SMT1TMRU
#define SMT1TMRU SMT1TMRU
SMT1TMRU                                 equ 048Eh
// bitfield definitions
SMT1TMRU_SMT1TMR_POSN                    equ 0000h
SMT1TMRU_SMT1TMR_POSITION                equ 0000h
SMT1TMRU_SMT1TMR_SIZE                    equ 0008h
SMT1TMRU_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRU_SMT1TMR_MASK                    equ 00FFh
SMT1TMRU_SMT1TMR16_POSN                  equ 0000h
SMT1TMRU_SMT1TMR16_POSITION              equ 0000h
SMT1TMRU_SMT1TMR16_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR16_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR16_MASK                  equ 0001h
SMT1TMRU_SMT1TMR17_POSN                  equ 0001h
SMT1TMRU_SMT1TMR17_POSITION              equ 0001h
SMT1TMRU_SMT1TMR17_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR17_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR17_MASK                  equ 0002h
SMT1TMRU_SMT1TMR18_POSN                  equ 0002h
SMT1TMRU_SMT1TMR18_POSITION              equ 0002h
SMT1TMRU_SMT1TMR18_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR18_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR18_MASK                  equ 0004h
SMT1TMRU_SMT1TMR19_POSN                  equ 0003h
SMT1TMRU_SMT1TMR19_POSITION              equ 0003h
SMT1TMRU_SMT1TMR19_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR19_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR19_MASK                  equ 0008h
SMT1TMRU_SMT1TMR20_POSN                  equ 0004h
SMT1TMRU_SMT1TMR20_POSITION              equ 0004h
SMT1TMRU_SMT1TMR20_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR20_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR20_MASK                  equ 0010h
SMT1TMRU_SMT1TMR21_POSN                  equ 0005h
SMT1TMRU_SMT1TMR21_POSITION              equ 0005h
SMT1TMRU_SMT1TMR21_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR21_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR21_MASK                  equ 0020h
SMT1TMRU_SMT1TMR22_POSN                  equ 0006h
SMT1TMRU_SMT1TMR22_POSITION              equ 0006h
SMT1TMRU_SMT1TMR22_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR22_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR22_MASK                  equ 0040h
SMT1TMRU_SMT1TMR23_POSN                  equ 0007h
SMT1TMRU_SMT1TMR23_POSITION              equ 0007h
SMT1TMRU_SMT1TMR23_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR23_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR23_MASK                  equ 0080h

// Register: SMT1CPRL
#define SMT1CPRL SMT1CPRL
SMT1CPRL                                 equ 048Fh
// bitfield definitions
SMT1CPRL_CPR_POSN                        equ 0000h
SMT1CPRL_CPR_POSITION                    equ 0000h
SMT1CPRL_CPR_SIZE                        equ 0008h
SMT1CPRL_CPR_LENGTH                      equ 0008h
SMT1CPRL_CPR_MASK                        equ 00FFh
SMT1CPRL_CPR0_POSN                       equ 0000h
SMT1CPRL_CPR0_POSITION                   equ 0000h
SMT1CPRL_CPR0_SIZE                       equ 0001h
SMT1CPRL_CPR0_LENGTH                     equ 0001h
SMT1CPRL_CPR0_MASK                       equ 0001h
SMT1CPRL_CPR1_POSN                       equ 0001h
SMT1CPRL_CPR1_POSITION                   equ 0001h
SMT1CPRL_CPR1_SIZE                       equ 0001h
SMT1CPRL_CPR1_LENGTH                     equ 0001h
SMT1CPRL_CPR1_MASK                       equ 0002h
SMT1CPRL_CPR2_POSN                       equ 0002h
SMT1CPRL_CPR2_POSITION                   equ 0002h
SMT1CPRL_CPR2_SIZE                       equ 0001h
SMT1CPRL_CPR2_LENGTH                     equ 0001h
SMT1CPRL_CPR2_MASK                       equ 0004h
SMT1CPRL_CPR3_POSN                       equ 0003h
SMT1CPRL_CPR3_POSITION                   equ 0003h
SMT1CPRL_CPR3_SIZE                       equ 0001h
SMT1CPRL_CPR3_LENGTH                     equ 0001h
SMT1CPRL_CPR3_MASK                       equ 0008h
SMT1CPRL_CPR4_POSN                       equ 0004h
SMT1CPRL_CPR4_POSITION                   equ 0004h
SMT1CPRL_CPR4_SIZE                       equ 0001h
SMT1CPRL_CPR4_LENGTH                     equ 0001h
SMT1CPRL_CPR4_MASK                       equ 0010h
SMT1CPRL_CPR5_POSN                       equ 0005h
SMT1CPRL_CPR5_POSITION                   equ 0005h
SMT1CPRL_CPR5_SIZE                       equ 0001h
SMT1CPRL_CPR5_LENGTH                     equ 0001h
SMT1CPRL_CPR5_MASK                       equ 0020h
SMT1CPRL_CPR6_POSN                       equ 0006h
SMT1CPRL_CPR6_POSITION                   equ 0006h
SMT1CPRL_CPR6_SIZE                       equ 0001h
SMT1CPRL_CPR6_LENGTH                     equ 0001h
SMT1CPRL_CPR6_MASK                       equ 0040h
SMT1CPRL_CPR7_POSN                       equ 0007h
SMT1CPRL_CPR7_POSITION                   equ 0007h
SMT1CPRL_CPR7_SIZE                       equ 0001h
SMT1CPRL_CPR7_LENGTH                     equ 0001h
SMT1CPRL_CPR7_MASK                       equ 0080h
SMT1CPRL_SMT1CPR_POSN                    equ 0000h
SMT1CPRL_SMT1CPR_POSITION                equ 0000h
SMT1CPRL_SMT1CPR_SIZE                    equ 0008h
SMT1CPRL_SMT1CPR_LENGTH                  equ 0008h
SMT1CPRL_SMT1CPR_MASK                    equ 00FFh

// Register: SMT1CPRH
#define SMT1CPRH SMT1CPRH
SMT1CPRH                                 equ 0490h
// bitfield definitions
SMT1CPRH_CPR_POSN                        equ 0000h
SMT1CPRH_CPR_POSITION                    equ 0000h
SMT1CPRH_CPR_SIZE                        equ 0008h
SMT1CPRH_CPR_LENGTH                      equ 0008h
SMT1CPRH_CPR_MASK                        equ 00FFh
SMT1CPRH_CPR8_POSN                       equ 0000h
SMT1CPRH_CPR8_POSITION                   equ 0000h
SMT1CPRH_CPR8_SIZE                       equ 0001h
SMT1CPRH_CPR8_LENGTH                     equ 0001h
SMT1CPRH_CPR8_MASK                       equ 0001h
SMT1CPRH_CPR9_POSN                       equ 0001h
SMT1CPRH_CPR9_POSITION                   equ 0001h
SMT1CPRH_CPR9_SIZE                       equ 0001h
SMT1CPRH_CPR9_LENGTH                     equ 0001h
SMT1CPRH_CPR9_MASK                       equ 0002h
SMT1CPRH_CPR10_POSN                      equ 0002h
SMT1CPRH_CPR10_POSITION                  equ 0002h
SMT1CPRH_CPR10_SIZE                      equ 0001h
SMT1CPRH_CPR10_LENGTH                    equ 0001h
SMT1CPRH_CPR10_MASK                      equ 0004h
SMT1CPRH_CPR11_POSN                      equ 0003h
SMT1CPRH_CPR11_POSITION                  equ 0003h
SMT1CPRH_CPR11_SIZE                      equ 0001h
SMT1CPRH_CPR11_LENGTH                    equ 0001h
SMT1CPRH_CPR11_MASK                      equ 0008h
SMT1CPRH_CPR12_POSN                      equ 0004h
SMT1CPRH_CPR12_POSITION                  equ 0004h
SMT1CPRH_CPR12_SIZE                      equ 0001h
SMT1CPRH_CPR12_LENGTH                    equ 0001h
SMT1CPRH_CPR12_MASK                      equ 0010h
SMT1CPRH_CPR13_POSN                      equ 0005h
SMT1CPRH_CPR13_POSITION                  equ 0005h
SMT1CPRH_CPR13_SIZE                      equ 0001h
SMT1CPRH_CPR13_LENGTH                    equ 0001h
SMT1CPRH_CPR13_MASK                      equ 0020h
SMT1CPRH_CPR14_POSN                      equ 0006h
SMT1CPRH_CPR14_POSITION                  equ 0006h
SMT1CPRH_CPR14_SIZE                      equ 0001h
SMT1CPRH_CPR14_LENGTH                    equ 0001h
SMT1CPRH_CPR14_MASK                      equ 0040h
SMT1CPRH_CPR15_POSN                      equ 0007h
SMT1CPRH_CPR15_POSITION                  equ 0007h
SMT1CPRH_CPR15_SIZE                      equ 0001h
SMT1CPRH_CPR15_LENGTH                    equ 0001h
SMT1CPRH_CPR15_MASK                      equ 0080h
SMT1CPRH_SMT1CPR8_POSN                   equ 0000h
SMT1CPRH_SMT1CPR8_POSITION               equ 0000h
SMT1CPRH_SMT1CPR8_SIZE                   equ 0001h
SMT1CPRH_SMT1CPR8_LENGTH                 equ 0001h
SMT1CPRH_SMT1CPR8_MASK                   equ 0001h
SMT1CPRH_SMT1CPR9_POSN                   equ 0001h
SMT1CPRH_SMT1CPR9_POSITION               equ 0001h
SMT1CPRH_SMT1CPR9_SIZE                   equ 0001h
SMT1CPRH_SMT1CPR9_LENGTH                 equ 0001h
SMT1CPRH_SMT1CPR9_MASK                   equ 0002h
SMT1CPRH_SMT1CPR10_POSN                  equ 0002h
SMT1CPRH_SMT1CPR10_POSITION              equ 0002h
SMT1CPRH_SMT1CPR10_SIZE                  equ 0001h
SMT1CPRH_SMT1CPR10_LENGTH                equ 0001h
SMT1CPRH_SMT1CPR10_MASK                  equ 0004h
SMT1CPRH_SMT1CPR11_POSN                  equ 0003h
SMT1CPRH_SMT1CPR11_POSITION              equ 0003h
SMT1CPRH_SMT1CPR11_SIZE                  equ 0001h
SMT1CPRH_SMT1CPR11_LENGTH                equ 0001h
SMT1CPRH_SMT1CPR11_MASK                  equ 0008h
SMT1CPRH_SMT1CPR12_POSN                  equ 0004h
SMT1CPRH_SMT1CPR12_POSITION              equ 0004h
SMT1CPRH_SMT1CPR12_SIZE                  equ 0001h
SMT1CPRH_SMT1CPR12_LENGTH                equ 0001h
SMT1CPRH_SMT1CPR12_MASK                  equ 0010h
SMT1CPRH_SMT1CPR13_POSN                  equ 0005h
SMT1CPRH_SMT1CPR13_POSITION              equ 0005h
SMT1CPRH_SMT1CPR13_SIZE                  equ 0001h
SMT1CPRH_SMT1CPR13_LENGTH                equ 0001h
SMT1CPRH_SMT1CPR13_MASK                  equ 0020h
SMT1CPRH_SMT1CPR14_POSN                  equ 0006h
SMT1CPRH_SMT1CPR14_POSITION              equ 0006h
SMT1CPRH_SMT1CPR14_SIZE                  equ 0001h
SMT1CPRH_SMT1CPR14_LENGTH                equ 0001h
SMT1CPRH_SMT1CPR14_MASK                  equ 0040h
SMT1CPRH_SMT1CPR15_POSN                  equ 0007h
SMT1CPRH_SMT1CPR15_POSITION              equ 0007h
SMT1CPRH_SMT1CPR15_SIZE                  equ 0001h
SMT1CPRH_SMT1CPR15_LENGTH                equ 0001h
SMT1CPRH_SMT1CPR15_MASK                  equ 0080h
SMT1CPRH_SMT1CPR_POSN                    equ 0000h
SMT1CPRH_SMT1CPR_POSITION                equ 0000h
SMT1CPRH_SMT1CPR_SIZE                    equ 0008h
SMT1CPRH_SMT1CPR_LENGTH                  equ 0008h
SMT1CPRH_SMT1CPR_MASK                    equ 00FFh

// Register: SMT1CPRU
#define SMT1CPRU SMT1CPRU
SMT1CPRU                                 equ 0491h
// bitfield definitions
SMT1CPRU_CPR_POSN                        equ 0000h
SMT1CPRU_CPR_POSITION                    equ 0000h
SMT1CPRU_CPR_SIZE                        equ 0008h
SMT1CPRU_CPR_LENGTH                      equ 0008h
SMT1CPRU_CPR_MASK                        equ 00FFh
SMT1CPRU_CPR16_POSN                      equ 0000h
SMT1CPRU_CPR16_POSITION                  equ 0000h
SMT1CPRU_CPR16_SIZE                      equ 0001h
SMT1CPRU_CPR16_LENGTH                    equ 0001h
SMT1CPRU_CPR16_MASK                      equ 0001h
SMT1CPRU_CPR17_POSN                      equ 0001h
SMT1CPRU_CPR17_POSITION                  equ 0001h
SMT1CPRU_CPR17_SIZE                      equ 0001h
SMT1CPRU_CPR17_LENGTH                    equ 0001h
SMT1CPRU_CPR17_MASK                      equ 0002h
SMT1CPRU_CPR18_POSN                      equ 0002h
SMT1CPRU_CPR18_POSITION                  equ 0002h
SMT1CPRU_CPR18_SIZE                      equ 0001h
SMT1CPRU_CPR18_LENGTH                    equ 0001h
SMT1CPRU_CPR18_MASK                      equ 0004h
SMT1CPRU_CPR19_POSN                      equ 0003h
SMT1CPRU_CPR19_POSITION                  equ 0003h
SMT1CPRU_CPR19_SIZE                      equ 0001h
SMT1CPRU_CPR19_LENGTH                    equ 0001h
SMT1CPRU_CPR19_MASK                      equ 0008h
SMT1CPRU_CPR20_POSN                      equ 0004h
SMT1CPRU_CPR20_POSITION                  equ 0004h
SMT1CPRU_CPR20_SIZE                      equ 0001h
SMT1CPRU_CPR20_LENGTH                    equ 0001h
SMT1CPRU_CPR20_MASK                      equ 0010h
SMT1CPRU_CPR21_POSN                      equ 0005h
SMT1CPRU_CPR21_POSITION                  equ 0005h
SMT1CPRU_CPR21_SIZE                      equ 0001h
SMT1CPRU_CPR21_LENGTH                    equ 0001h
SMT1CPRU_CPR21_MASK                      equ 0020h
SMT1CPRU_CPR22_POSN                      equ 0006h
SMT1CPRU_CPR22_POSITION                  equ 0006h
SMT1CPRU_CPR22_SIZE                      equ 0001h
SMT1CPRU_CPR22_LENGTH                    equ 0001h
SMT1CPRU_CPR22_MASK                      equ 0040h
SMT1CPRU_CPR23_POSN                      equ 0007h
SMT1CPRU_CPR23_POSITION                  equ 0007h
SMT1CPRU_CPR23_SIZE                      equ 0001h
SMT1CPRU_CPR23_LENGTH                    equ 0001h
SMT1CPRU_CPR23_MASK                      equ 0080h
SMT1CPRU_SMT1CPR16_POSN                  equ 0000h
SMT1CPRU_SMT1CPR16_POSITION              equ 0000h
SMT1CPRU_SMT1CPR16_SIZE                  equ 0001h
SMT1CPRU_SMT1CPR16_LENGTH                equ 0001h
SMT1CPRU_SMT1CPR16_MASK                  equ 0001h
SMT1CPRU_SMT1CPR17_POSN                  equ 0001h
SMT1CPRU_SMT1CPR17_POSITION              equ 0001h
SMT1CPRU_SMT1CPR17_SIZE                  equ 0001h
SMT1CPRU_SMT1CPR17_LENGTH                equ 0001h
SMT1CPRU_SMT1CPR17_MASK                  equ 0002h
SMT1CPRU_SMT1CPR18_POSN                  equ 0002h
SMT1CPRU_SMT1CPR18_POSITION              equ 0002h
SMT1CPRU_SMT1CPR18_SIZE                  equ 0001h
SMT1CPRU_SMT1CPR18_LENGTH                equ 0001h
SMT1CPRU_SMT1CPR18_MASK                  equ 0004h
SMT1CPRU_SMT1CPR19_POSN                  equ 0003h
SMT1CPRU_SMT1CPR19_POSITION              equ 0003h
SMT1CPRU_SMT1CPR19_SIZE                  equ 0001h
SMT1CPRU_SMT1CPR19_LENGTH                equ 0001h
SMT1CPRU_SMT1CPR19_MASK                  equ 0008h
SMT1CPRU_SMT1CPR20_POSN                  equ 0004h
SMT1CPRU_SMT1CPR20_POSITION              equ 0004h
SMT1CPRU_SMT1CPR20_SIZE                  equ 0001h
SMT1CPRU_SMT1CPR20_LENGTH                equ 0001h
SMT1CPRU_SMT1CPR20_MASK                  equ 0010h
SMT1CPRU_SMT1CPR21_POSN                  equ 0005h
SMT1CPRU_SMT1CPR21_POSITION              equ 0005h
SMT1CPRU_SMT1CPR21_SIZE                  equ 0001h
SMT1CPRU_SMT1CPR21_LENGTH                equ 0001h
SMT1CPRU_SMT1CPR21_MASK                  equ 0020h
SMT1CPRU_SMT1CPR22_POSN                  equ 0006h
SMT1CPRU_SMT1CPR22_POSITION              equ 0006h
SMT1CPRU_SMT1CPR22_SIZE                  equ 0001h
SMT1CPRU_SMT1CPR22_LENGTH                equ 0001h
SMT1CPRU_SMT1CPR22_MASK                  equ 0040h
SMT1CPRU_SMT1CPR23_POSN                  equ 0007h
SMT1CPRU_SMT1CPR23_POSITION              equ 0007h
SMT1CPRU_SMT1CPR23_SIZE                  equ 0001h
SMT1CPRU_SMT1CPR23_LENGTH                equ 0001h
SMT1CPRU_SMT1CPR23_MASK                  equ 0080h
SMT1CPRU_SMT1CPR_POSN                    equ 0000h
SMT1CPRU_SMT1CPR_POSITION                equ 0000h
SMT1CPRU_SMT1CPR_SIZE                    equ 0008h
SMT1CPRU_SMT1CPR_LENGTH                  equ 0008h
SMT1CPRU_SMT1CPR_MASK                    equ 00FFh

