GopalSaraf/Practicals/PSDL/include/proc/pic16f19186.inc
// Register: ALRMRPT
#define ALRMRPT ALRMRPT
ALRMRPT                                  equ 0C0Fh
// bitfield definitions
ALRMRPT_ARPT_POSN                        equ 0000h
ALRMRPT_ARPT_POSITION                    equ 0000h
ALRMRPT_ARPT_SIZE                        equ 0008h
ALRMRPT_ARPT_LENGTH                      equ 0008h
ALRMRPT_ARPT_MASK                        equ 00FFh
ALRMRPT_ARPT0_POSN                       equ 0000h
ALRMRPT_ARPT0_POSITION                   equ 0000h
ALRMRPT_ARPT0_SIZE                       equ 0001h
ALRMRPT_ARPT0_LENGTH                     equ 0001h
ALRMRPT_ARPT0_MASK                       equ 0001h
ALRMRPT_ARPT1_POSN                       equ 0001h
ALRMRPT_ARPT1_POSITION                   equ 0001h
ALRMRPT_ARPT1_SIZE                       equ 0001h
ALRMRPT_ARPT1_LENGTH                     equ 0001h
ALRMRPT_ARPT1_MASK                       equ 0002h
ALRMRPT_ARPT2_POSN                       equ 0002h
ALRMRPT_ARPT2_POSITION                   equ 0002h
ALRMRPT_ARPT2_SIZE                       equ 0001h
ALRMRPT_ARPT2_LENGTH                     equ 0001h
ALRMRPT_ARPT2_MASK                       equ 0004h
ALRMRPT_ARPT3_POSN                       equ 0003h
ALRMRPT_ARPT3_POSITION                   equ 0003h
ALRMRPT_ARPT3_SIZE                       equ 0001h
ALRMRPT_ARPT3_LENGTH                     equ 0001h
ALRMRPT_ARPT3_MASK                       equ 0008h
ALRMRPT_ARPT4_POSN                       equ 0004h
ALRMRPT_ARPT4_POSITION                   equ 0004h
ALRMRPT_ARPT4_SIZE                       equ 0001h
ALRMRPT_ARPT4_LENGTH                     equ 0001h
ALRMRPT_ARPT4_MASK                       equ 0010h
ALRMRPT_ARPT5_POSN                       equ 0005h
ALRMRPT_ARPT5_POSITION                   equ 0005h
ALRMRPT_ARPT5_SIZE                       equ 0001h
ALRMRPT_ARPT5_LENGTH                     equ 0001h
ALRMRPT_ARPT5_MASK                       equ 0020h
ALRMRPT_ARPT6_POSN                       equ 0006h
ALRMRPT_ARPT6_POSITION                   equ 0006h
ALRMRPT_ARPT6_SIZE                       equ 0001h
ALRMRPT_ARPT6_LENGTH                     equ 0001h
ALRMRPT_ARPT6_MASK                       equ 0040h
ALRMRPT_ARPT7_POSN                       equ 0007h
ALRMRPT_ARPT7_POSITION                   equ 0007h
ALRMRPT_ARPT7_SIZE                       equ 0001h
ALRMRPT_ARPT7_LENGTH                     equ 0001h
ALRMRPT_ARPT7_MASK                       equ 0080h

// Register: YEAR
#define YEAR YEAR
YEAR                                     equ 0C10h
// bitfield definitions
YEAR_YEARL_POSN                          equ 0000h
YEAR_YEARL_POSITION                      equ 0000h
YEAR_YEARL_SIZE                          equ 0004h
YEAR_YEARL_LENGTH                        equ 0004h
YEAR_YEARL_MASK                          equ 000Fh
YEAR_YEARH_POSN                          equ 0004h
YEAR_YEARH_POSITION                      equ 0004h
YEAR_YEARH_SIZE                          equ 0004h
YEAR_YEARH_LENGTH                        equ 0004h
YEAR_YEARH_MASK                          equ 00F0h
YEAR_YEARL0_POSN                         equ 0000h
YEAR_YEARL0_POSITION                     equ 0000h
YEAR_YEARL0_SIZE                         equ 0001h
YEAR_YEARL0_LENGTH                       equ 0001h
YEAR_YEARL0_MASK                         equ 0001h
YEAR_YEARL1_POSN                         equ 0001h
YEAR_YEARL1_POSITION                     equ 0001h
YEAR_YEARL1_SIZE                         equ 0001h
YEAR_YEARL1_LENGTH                       equ 0001h
YEAR_YEARL1_MASK                         equ 0002h
YEAR_YEARL2_POSN                         equ 0002h
YEAR_YEARL2_POSITION                     equ 0002h
YEAR_YEARL2_SIZE                         equ 0001h
YEAR_YEARL2_LENGTH                       equ 0001h
YEAR_YEARL2_MASK                         equ 0004h
YEAR_YEARL3_POSN                         equ 0003h
YEAR_YEARL3_POSITION                     equ 0003h
YEAR_YEARL3_SIZE                         equ 0001h
YEAR_YEARL3_LENGTH                       equ 0001h
YEAR_YEARL3_MASK                         equ 0008h
YEAR_YEARH0_POSN                         equ 0004h
YEAR_YEARH0_POSITION                     equ 0004h
YEAR_YEARH0_SIZE                         equ 0001h
YEAR_YEARH0_LENGTH                       equ 0001h
YEAR_YEARH0_MASK                         equ 0010h
YEAR_YEARH1_POSN                         equ 0005h
YEAR_YEARH1_POSITION                     equ 0005h
YEAR_YEARH1_SIZE                         equ 0001h
YEAR_YEARH1_LENGTH                       equ 0001h
YEAR_YEARH1_MASK                         equ 0020h
YEAR_YEARH2_POSN                         equ 0006h
YEAR_YEARH2_POSITION                     equ 0006h
YEAR_YEARH2_SIZE                         equ 0001h
YEAR_YEARH2_LENGTH                       equ 0001h
YEAR_YEARH2_MASK                         equ 0040h
YEAR_YEARH3_POSN                         equ 0007h
YEAR_YEARH3_POSITION                     equ 0007h
YEAR_YEARH3_SIZE                         equ 0001h
YEAR_YEARH3_LENGTH                       equ 0001h
YEAR_YEARH3_MASK                         equ 0080h

// Register: MONTH
#define MONTH MONTH
MONTH                                    equ 0C11h
// bitfield definitions
MONTH_MONTHL_POSN                        equ 0000h
MONTH_MONTHL_POSITION                    equ 0000h
MONTH_MONTHL_SIZE                        equ 0004h
MONTH_MONTHL_LENGTH                      equ 0004h
MONTH_MONTHL_MASK                        equ 000Fh
MONTH_MONTHL0_POSN                       equ 0000h
MONTH_MONTHL0_POSITION                   equ 0000h
MONTH_MONTHL0_SIZE                       equ 0001h
MONTH_MONTHL0_LENGTH                     equ 0001h
MONTH_MONTHL0_MASK                       equ 0001h
MONTH_MONTHL1_POSN                       equ 0001h
MONTH_MONTHL1_POSITION                   equ 0001h
MONTH_MONTHL1_SIZE                       equ 0001h
MONTH_MONTHL1_LENGTH                     equ 0001h
MONTH_MONTHL1_MASK                       equ 0002h
MONTH_MONTHL2_POSN                       equ 0002h
MONTH_MONTHL2_POSITION                   equ 0002h
MONTH_MONTHL2_SIZE                       equ 0001h
MONTH_MONTHL2_LENGTH                     equ 0001h
MONTH_MONTHL2_MASK                       equ 0004h
MONTH_MONTHL3_POSN                       equ 0003h
MONTH_MONTHL3_POSITION                   equ 0003h
MONTH_MONTHL3_SIZE                       equ 0001h
MONTH_MONTHL3_LENGTH                     equ 0001h
MONTH_MONTHL3_MASK                       equ 0008h
MONTH_MONTHH_POSN                        equ 0004h
MONTH_MONTHH_POSITION                    equ 0004h
MONTH_MONTHH_SIZE                        equ 0001h
MONTH_MONTHH_LENGTH                      equ 0001h
MONTH_MONTHH_MASK                        equ 0010h

// Register: WEEKDAY
#define WEEKDAY WEEKDAY
WEEKDAY                                  equ 0C12h
// bitfield definitions
WEEKDAY_WDAY_POSN                        equ 0000h
WEEKDAY_WDAY_POSITION                    equ 0000h
WEEKDAY_WDAY_SIZE                        equ 0003h
WEEKDAY_WDAY_LENGTH                      equ 0003h
WEEKDAY_WDAY_MASK                        equ 0007h
WEEKDAY_WDAY0_POSN                       equ 0000h
WEEKDAY_WDAY0_POSITION                   equ 0000h
WEEKDAY_WDAY0_SIZE                       equ 0001h
WEEKDAY_WDAY0_LENGTH                     equ 0001h
WEEKDAY_WDAY0_MASK                       equ 0001h
WEEKDAY_WDAY1_POSN                       equ 0001h
WEEKDAY_WDAY1_POSITION                   equ 0001h
WEEKDAY_WDAY1_SIZE                       equ 0001h
WEEKDAY_WDAY1_LENGTH                     equ 0001h
WEEKDAY_WDAY1_MASK                       equ 0002h
WEEKDAY_WDAY2_POSN                       equ 0002h
WEEKDAY_WDAY2_POSITION                   equ 0002h
WEEKDAY_WDAY2_SIZE                       equ 0001h
WEEKDAY_WDAY2_LENGTH                     equ 0001h
WEEKDAY_WDAY2_MASK                       equ 0004h

// Register: DAY
#define DAY DAY
DAY                                      equ 0C13h
// bitfield definitions
DAY_DAYL_POSN                            equ 0000h
DAY_DAYL_POSITION                        equ 0000h
DAY_DAYL_SIZE                            equ 0004h
DAY_DAYL_LENGTH                          equ 0004h
DAY_DAYL_MASK                            equ 000Fh
DAY_DAYH_POSN                            equ 0004h
DAY_DAYH_POSITION                        equ 0004h
DAY_DAYH_SIZE                            equ 0002h
DAY_DAYH_LENGTH                          equ 0002h
DAY_DAYH_MASK                            equ 0030h
DAY_DAYL0_POSN                           equ 0000h
DAY_DAYL0_POSITION                       equ 0000h
DAY_DAYL0_SIZE                           equ 0001h
DAY_DAYL0_LENGTH                         equ 0001h
DAY_DAYL0_MASK                           equ 0001h
DAY_DAYL1_POSN                           equ 0001h
DAY_DAYL1_POSITION                       equ 0001h
DAY_DAYL1_SIZE                           equ 0001h
DAY_DAYL1_LENGTH                         equ 0001h
DAY_DAYL1_MASK                           equ 0002h
DAY_DAYL2_POSN                           equ 0002h
DAY_DAYL2_POSITION                       equ 0002h
DAY_DAYL2_SIZE                           equ 0001h
DAY_DAYL2_LENGTH                         equ 0001h
DAY_DAYL2_MASK                           equ 0004h
DAY_DAYL3_POSN                           equ 0003h
DAY_DAYL3_POSITION                       equ 0003h
DAY_DAYL3_SIZE                           equ 0001h
DAY_DAYL3_LENGTH                         equ 0001h
DAY_DAYL3_MASK                           equ 0008h
DAY_DAYH0_POSN                           equ 0004h
DAY_DAYH0_POSITION                       equ 0004h
DAY_DAYH0_SIZE                           equ 0001h
DAY_DAYH0_LENGTH                         equ 0001h
DAY_DAYH0_MASK                           equ 0010h
DAY_DAYH1_POSN                           equ 0005h
DAY_DAYH1_POSITION                       equ 0005h
DAY_DAYH1_SIZE                           equ 0001h
DAY_DAYH1_LENGTH                         equ 0001h
DAY_DAYH1_MASK                           equ 0020h

// Register: HOURS
#define HOURS HOURS
HOURS                                    equ 0C14h
// bitfield definitions
HOURS_HRL_POSN                           equ 0000h
HOURS_HRL_POSITION                       equ 0000h
HOURS_HRL_SIZE                           equ 0004h
HOURS_HRL_LENGTH                         equ 0004h
HOURS_HRL_MASK                           equ 000Fh
HOURS_HRH_POSN                           equ 0004h
HOURS_HRH_POSITION                       equ 0004h
HOURS_HRH_SIZE                           equ 0002h
HOURS_HRH_LENGTH                         equ 0002h
HOURS_HRH_MASK                           equ 0030h
HOURS_HRL0_POSN                          equ 0000h
HOURS_HRL0_POSITION                      equ 0000h
HOURS_HRL0_SIZE                          equ 0001h
HOURS_HRL0_LENGTH                        equ 0001h
HOURS_HRL0_MASK                          equ 0001h
HOURS_HRL1_POSN                          equ 0001h
HOURS_HRL1_POSITION                      equ 0001h
HOURS_HRL1_SIZE                          equ 0001h
HOURS_HRL1_LENGTH                        equ 0001h
HOURS_HRL1_MASK                          equ 0002h
HOURS_HRL2_POSN                          equ 0002h
HOURS_HRL2_POSITION                      equ 0002h
HOURS_HRL2_SIZE                          equ 0001h
HOURS_HRL2_LENGTH                        equ 0001h
HOURS_HRL2_MASK                          equ 0004h
HOURS_HRL3_POSN                          equ 0003h
HOURS_HRL3_POSITION                      equ 0003h
HOURS_HRL3_SIZE                          equ 0001h
HOURS_HRL3_LENGTH                        equ 0001h
HOURS_HRL3_MASK                          equ 0008h
HOURS_HRH0_POSN                          equ 0004h
HOURS_HRH0_POSITION                      equ 0004h
HOURS_HRH0_SIZE                          equ 0001h
HOURS_HRH0_LENGTH                        equ 0001h
HOURS_HRH0_MASK                          equ 0010h
HOURS_HRH1_POSN                          equ 0005h
HOURS_HRH1_POSITION                      equ 0005h
HOURS_HRH1_SIZE                          equ 0001h
HOURS_HRH1_LENGTH                        equ 0001h
HOURS_HRH1_MASK                          equ 0020h

// Register: MINUTES
#define MINUTES MINUTES
MINUTES                                  equ 0C15h
// bitfield definitions
MINUTES_MINL_POSN                        equ 0000h
MINUTES_MINL_POSITION                    equ 0000h
MINUTES_MINL_SIZE                        equ 0004h
MINUTES_MINL_LENGTH                      equ 0004h
MINUTES_MINL_MASK                        equ 000Fh
MINUTES_MINH_POSN                        equ 0004h
MINUTES_MINH_POSITION                    equ 0004h
MINUTES_MINH_SIZE                        equ 0003h
MINUTES_MINH_LENGTH                      equ 0003h
MINUTES_MINH_MASK                        equ 0070h
MINUTES_MINL0_POSN                       equ 0000h
MINUTES_MINL0_POSITION                   equ 0000h
MINUTES_MINL0_SIZE                       equ 0001h
MINUTES_MINL0_LENGTH                     equ 0001h
MINUTES_MINL0_MASK                       equ 0001h
MINUTES_MINL1_POSN                       equ 0001h
MINUTES_MINL1_POSITION                   equ 0001h
MINUTES_MINL1_SIZE                       equ 0001h
MINUTES_MINL1_LENGTH                     equ 0001h
MINUTES_MINL1_MASK                       equ 0002h
MINUTES_MINL2_POSN                       equ 0002h
MINUTES_MINL2_POSITION                   equ 0002h
MINUTES_MINL2_SIZE                       equ 0001h
MINUTES_MINL2_LENGTH                     equ 0001h
MINUTES_MINL2_MASK                       equ 0004h
MINUTES_MINL3_POSN                       equ 0003h
MINUTES_MINL3_POSITION                   equ 0003h
MINUTES_MINL3_SIZE                       equ 0001h
MINUTES_MINL3_LENGTH                     equ 0001h
MINUTES_MINL3_MASK                       equ 0008h
MINUTES_MINH0_POSN                       equ 0004h
MINUTES_MINH0_POSITION                   equ 0004h
MINUTES_MINH0_SIZE                       equ 0001h
MINUTES_MINH0_LENGTH                     equ 0001h
MINUTES_MINH0_MASK                       equ 0010h
MINUTES_MINH1_POSN                       equ 0005h
MINUTES_MINH1_POSITION                   equ 0005h
MINUTES_MINH1_SIZE                       equ 0001h
MINUTES_MINH1_LENGTH                     equ 0001h
MINUTES_MINH1_MASK                       equ 0020h
MINUTES_MINH2_POSN                       equ 0006h
MINUTES_MINH2_POSITION                   equ 0006h
MINUTES_MINH2_SIZE                       equ 0001h
MINUTES_MINH2_LENGTH                     equ 0001h
MINUTES_MINH2_MASK                       equ 0040h

