GopalSaraf/Practicals/PSDL/include/proc/pic16f19186.inc
// Register: LCDDATA34
#define LCDDATA34 LCDDATA34
LCDDATA34                                equ 01D3Ah
// bitfield definitions
LCDDATA34_S32C5_POSN                     equ 0000h
LCDDATA34_S32C5_POSITION                 equ 0000h
LCDDATA34_S32C5_SIZE                     equ 0001h
LCDDATA34_S32C5_LENGTH                   equ 0001h
LCDDATA34_S32C5_MASK                     equ 0001h
LCDDATA34_S33C5_POSN                     equ 0001h
LCDDATA34_S33C5_POSITION                 equ 0001h
LCDDATA34_S33C5_SIZE                     equ 0001h
LCDDATA34_S33C5_LENGTH                   equ 0001h
LCDDATA34_S33C5_MASK                     equ 0002h
LCDDATA34_S34C5_POSN                     equ 0002h
LCDDATA34_S34C5_POSITION                 equ 0002h
LCDDATA34_S34C5_SIZE                     equ 0001h
LCDDATA34_S34C5_LENGTH                   equ 0001h
LCDDATA34_S34C5_MASK                     equ 0004h

// Register: LCDDATA35
#define LCDDATA35 LCDDATA35
LCDDATA35                                equ 01D3Bh
// bitfield definitions
LCDDATA35_S40C5_POSN                     equ 0000h
LCDDATA35_S40C5_POSITION                 equ 0000h
LCDDATA35_S40C5_SIZE                     equ 0001h
LCDDATA35_S40C5_LENGTH                   equ 0001h
LCDDATA35_S40C5_MASK                     equ 0001h
LCDDATA35_S41C5_POSN                     equ 0001h
LCDDATA35_S41C5_POSITION                 equ 0001h
LCDDATA35_S41C5_SIZE                     equ 0001h
LCDDATA35_S41C5_LENGTH                   equ 0001h
LCDDATA35_S41C5_MASK                     equ 0002h
LCDDATA35_S42C5_POSN                     equ 0002h
LCDDATA35_S42C5_POSITION                 equ 0002h
LCDDATA35_S42C5_SIZE                     equ 0001h
LCDDATA35_S42C5_LENGTH                   equ 0001h
LCDDATA35_S42C5_MASK                     equ 0004h
LCDDATA35_S43C5_POSN                     equ 0003h
LCDDATA35_S43C5_POSITION                 equ 0003h
LCDDATA35_S43C5_SIZE                     equ 0001h
LCDDATA35_S43C5_LENGTH                   equ 0001h
LCDDATA35_S43C5_MASK                     equ 0008h
LCDDATA35_S44C5_POSN                     equ 0004h
LCDDATA35_S44C5_POSITION                 equ 0004h
LCDDATA35_S44C5_SIZE                     equ 0001h
LCDDATA35_S44C5_LENGTH                   equ 0001h
LCDDATA35_S44C5_MASK                     equ 0010h
LCDDATA35_S45C5_POSN                     equ 0005h
LCDDATA35_S45C5_POSITION                 equ 0005h
LCDDATA35_S45C5_SIZE                     equ 0001h
LCDDATA35_S45C5_LENGTH                   equ 0001h
LCDDATA35_S45C5_MASK                     equ 0020h
LCDDATA35_S46C5_POSN                     equ 0006h
LCDDATA35_S46C5_POSITION                 equ 0006h
LCDDATA35_S46C5_SIZE                     equ 0001h
LCDDATA35_S46C5_LENGTH                   equ 0001h
LCDDATA35_S46C5_MASK                     equ 0040h
LCDDATA35_S47C5_POSN                     equ 0007h
LCDDATA35_S47C5_POSITION                 equ 0007h
LCDDATA35_S47C5_SIZE                     equ 0001h
LCDDATA35_S47C5_LENGTH                   equ 0001h
LCDDATA35_S47C5_MASK                     equ 0080h

// Register: LCDDATA36
#define LCDDATA36 LCDDATA36
LCDDATA36                                equ 01D3Ch
// bitfield definitions
LCDDATA36_S00C6_POSN                     equ 0000h
LCDDATA36_S00C6_POSITION                 equ 0000h
LCDDATA36_S00C6_SIZE                     equ 0001h
LCDDATA36_S00C6_LENGTH                   equ 0001h
LCDDATA36_S00C6_MASK                     equ 0001h
LCDDATA36_S01C6_POSN                     equ 0001h
LCDDATA36_S01C6_POSITION                 equ 0001h
LCDDATA36_S01C6_SIZE                     equ 0001h
LCDDATA36_S01C6_LENGTH                   equ 0001h
LCDDATA36_S01C6_MASK                     equ 0002h
LCDDATA36_S02C6_POSN                     equ 0002h
LCDDATA36_S02C6_POSITION                 equ 0002h
LCDDATA36_S02C6_SIZE                     equ 0001h
LCDDATA36_S02C6_LENGTH                   equ 0001h
LCDDATA36_S02C6_MASK                     equ 0004h
LCDDATA36_S03C6_POSN                     equ 0003h
LCDDATA36_S03C6_POSITION                 equ 0003h
LCDDATA36_S03C6_SIZE                     equ 0001h
LCDDATA36_S03C6_LENGTH                   equ 0001h
LCDDATA36_S03C6_MASK                     equ 0008h
LCDDATA36_S04C6_POSN                     equ 0004h
LCDDATA36_S04C6_POSITION                 equ 0004h
LCDDATA36_S04C6_SIZE                     equ 0001h
LCDDATA36_S04C6_LENGTH                   equ 0001h
LCDDATA36_S04C6_MASK                     equ 0010h
LCDDATA36_S06C6_POSN                     equ 0006h
LCDDATA36_S06C6_POSITION                 equ 0006h
LCDDATA36_S06C6_SIZE                     equ 0001h
LCDDATA36_S06C6_LENGTH                   equ 0001h
LCDDATA36_S06C6_MASK                     equ 0040h
LCDDATA36_S07C6_POSN                     equ 0007h
LCDDATA36_S07C6_POSITION                 equ 0007h
LCDDATA36_S07C6_SIZE                     equ 0001h
LCDDATA36_S07C6_LENGTH                   equ 0001h
LCDDATA36_S07C6_MASK                     equ 0080h

// Register: LCDDATA37
#define LCDDATA37 LCDDATA37
LCDDATA37                                equ 01D3Dh
// bitfield definitions
LCDDATA37_S08C6_POSN                     equ 0000h
LCDDATA37_S08C6_POSITION                 equ 0000h
LCDDATA37_S08C6_SIZE                     equ 0001h
LCDDATA37_S08C6_LENGTH                   equ 0001h
LCDDATA37_S08C6_MASK                     equ 0001h
LCDDATA37_S09C6_POSN                     equ 0001h
LCDDATA37_S09C6_POSITION                 equ 0001h
LCDDATA37_S09C6_SIZE                     equ 0001h
LCDDATA37_S09C6_LENGTH                   equ 0001h
LCDDATA37_S09C6_MASK                     equ 0002h
LCDDATA37_S10C6_POSN                     equ 0002h
LCDDATA37_S10C6_POSITION                 equ 0002h
LCDDATA37_S10C6_SIZE                     equ 0001h
LCDDATA37_S10C6_LENGTH                   equ 0001h
LCDDATA37_S10C6_MASK                     equ 0004h
LCDDATA37_S11C6_POSN                     equ 0003h
LCDDATA37_S11C6_POSITION                 equ 0003h
LCDDATA37_S11C6_SIZE                     equ 0001h
LCDDATA37_S11C6_LENGTH                   equ 0001h
LCDDATA37_S11C6_MASK                     equ 0008h
LCDDATA37_S13C6_POSN                     equ 0005h
LCDDATA37_S13C6_POSITION                 equ 0005h
LCDDATA37_S13C6_SIZE                     equ 0001h
LCDDATA37_S13C6_LENGTH                   equ 0001h
LCDDATA37_S13C6_MASK                     equ 0020h
LCDDATA37_S14C6_POSN                     equ 0006h
LCDDATA37_S14C6_POSITION                 equ 0006h
LCDDATA37_S14C6_SIZE                     equ 0001h
LCDDATA37_S14C6_LENGTH                   equ 0001h
LCDDATA37_S14C6_MASK                     equ 0040h
LCDDATA37_S15C6_POSN                     equ 0007h
LCDDATA37_S15C6_POSITION                 equ 0007h
LCDDATA37_S15C6_SIZE                     equ 0001h
LCDDATA37_S15C6_LENGTH                   equ 0001h
LCDDATA37_S15C6_MASK                     equ 0080h

// Register: LCDDATA38
#define LCDDATA38 LCDDATA38
LCDDATA38                                equ 01D3Eh
// bitfield definitions
LCDDATA38_S18C6_POSN                     equ 0002h
LCDDATA38_S18C6_POSITION                 equ 0002h
LCDDATA38_S18C6_SIZE                     equ 0001h
LCDDATA38_S18C6_LENGTH                   equ 0001h
LCDDATA38_S18C6_MASK                     equ 0004h
LCDDATA38_S19C6_POSN                     equ 0003h
LCDDATA38_S19C6_POSITION                 equ 0003h
LCDDATA38_S19C6_SIZE                     equ 0001h
LCDDATA38_S19C6_LENGTH                   equ 0001h
LCDDATA38_S19C6_MASK                     equ 0008h
LCDDATA38_S20C6_POSN                     equ 0004h
LCDDATA38_S20C6_POSITION                 equ 0004h
LCDDATA38_S20C6_SIZE                     equ 0001h
LCDDATA38_S20C6_LENGTH                   equ 0001h
LCDDATA38_S20C6_MASK                     equ 0010h
LCDDATA38_S22C6_POSN                     equ 0006h
LCDDATA38_S22C6_POSITION                 equ 0006h
LCDDATA38_S22C6_SIZE                     equ 0001h
LCDDATA38_S22C6_LENGTH                   equ 0001h
LCDDATA38_S22C6_MASK                     equ 0040h
LCDDATA38_S23C6_POSN                     equ 0007h
LCDDATA38_S23C6_POSITION                 equ 0007h
LCDDATA38_S23C6_SIZE                     equ 0001h
LCDDATA38_S23C6_LENGTH                   equ 0001h
LCDDATA38_S23C6_MASK                     equ 0080h

// Register: LCDDATA39
#define LCDDATA39 LCDDATA39
LCDDATA39                                equ 01D3Fh
// bitfield definitions
LCDDATA39_S24C6_POSN                     equ 0000h
LCDDATA39_S24C6_POSITION                 equ 0000h
LCDDATA39_S24C6_SIZE                     equ 0001h
LCDDATA39_S24C6_LENGTH                   equ 0001h
LCDDATA39_S24C6_MASK                     equ 0001h
LCDDATA39_S25C6_POSN                     equ 0001h
LCDDATA39_S25C6_POSITION                 equ 0001h
LCDDATA39_S25C6_SIZE                     equ 0001h
LCDDATA39_S25C6_LENGTH                   equ 0001h
LCDDATA39_S25C6_MASK                     equ 0002h
LCDDATA39_S26C6_POSN                     equ 0002h
LCDDATA39_S26C6_POSITION                 equ 0002h
LCDDATA39_S26C6_SIZE                     equ 0001h
LCDDATA39_S26C6_LENGTH                   equ 0001h
LCDDATA39_S26C6_MASK                     equ 0004h
LCDDATA39_S27C6_POSN                     equ 0003h
LCDDATA39_S27C6_POSITION                 equ 0003h
LCDDATA39_S27C6_SIZE                     equ 0001h
LCDDATA39_S27C6_LENGTH                   equ 0001h
LCDDATA39_S27C6_MASK                     equ 0008h
LCDDATA39_S28C6_POSN                     equ 0004h
LCDDATA39_S28C6_POSITION                 equ 0004h
LCDDATA39_S28C6_SIZE                     equ 0001h
LCDDATA39_S28C6_LENGTH                   equ 0001h
LCDDATA39_S28C6_MASK                     equ 0010h
LCDDATA39_S29C6_POSN                     equ 0005h
LCDDATA39_S29C6_POSITION                 equ 0005h
LCDDATA39_S29C6_SIZE                     equ 0001h
LCDDATA39_S29C6_LENGTH                   equ 0001h
LCDDATA39_S29C6_MASK                     equ 0020h
LCDDATA39_S30C6_POSN                     equ 0006h
LCDDATA39_S30C6_POSITION                 equ 0006h
LCDDATA39_S30C6_SIZE                     equ 0001h
LCDDATA39_S30C6_LENGTH                   equ 0001h
LCDDATA39_S30C6_MASK                     equ 0040h
LCDDATA39_S31C6_POSN                     equ 0007h
LCDDATA39_S31C6_POSITION                 equ 0007h
LCDDATA39_S31C6_SIZE                     equ 0001h
LCDDATA39_S31C6_LENGTH                   equ 0001h
LCDDATA39_S31C6_MASK                     equ 0080h

// Register: LCDDATA40
#define LCDDATA40 LCDDATA40
LCDDATA40                                equ 01D40h
// bitfield definitions
LCDDATA40_S32C6_POSN                     equ 0000h
LCDDATA40_S32C6_POSITION                 equ 0000h
LCDDATA40_S32C6_SIZE                     equ 0001h
LCDDATA40_S32C6_LENGTH                   equ 0001h
LCDDATA40_S32C6_MASK                     equ 0001h
LCDDATA40_S33C6_POSN                     equ 0001h
LCDDATA40_S33C6_POSITION                 equ 0001h
LCDDATA40_S33C6_SIZE                     equ 0001h
LCDDATA40_S33C6_LENGTH                   equ 0001h
LCDDATA40_S33C6_MASK                     equ 0002h
LCDDATA40_S34C6_POSN                     equ 0002h
LCDDATA40_S34C6_POSITION                 equ 0002h
LCDDATA40_S34C6_SIZE                     equ 0001h
LCDDATA40_S34C6_LENGTH                   equ 0001h
LCDDATA40_S34C6_MASK                     equ 0004h

