GopalSaraf/Practicals/PSDL/include/proc/pic16f19186.inc
#define S11C6                            BANKMASK(LCDDATA37), 3
#define S11C7                            BANKMASK(LCDDATA43), 3
#define S13C0                            BANKMASK(LCDDATA1), 5
#define S13C1                            BANKMASK(LCDDATA7), 5
#define S13C2                            BANKMASK(LCDDATA13), 5
#define S13C3                            BANKMASK(LCDDATA19), 5
#define S13C4                            BANKMASK(LCDDATA25), 5
#define S13C5                            BANKMASK(LCDDATA31), 5
#define S13C6                            BANKMASK(LCDDATA37), 5
#define S13C7                            BANKMASK(LCDDATA43), 5
#define S14C0                            BANKMASK(LCDDATA1), 6
#define S14C1                            BANKMASK(LCDDATA7), 6
#define S14C2                            BANKMASK(LCDDATA13), 6
#define S14C3                            BANKMASK(LCDDATA19), 6
#define S14C4                            BANKMASK(LCDDATA25), 6
#define S14C5                            BANKMASK(LCDDATA31), 6
#define S14C6                            BANKMASK(LCDDATA37), 6
#define S14C7                            BANKMASK(LCDDATA43), 6
#define S15C0                            BANKMASK(LCDDATA1), 7
#define S15C1                            BANKMASK(LCDDATA7), 7
#define S15C2                            BANKMASK(LCDDATA13), 7
#define S15C3                            BANKMASK(LCDDATA19), 7
#define S15C4                            BANKMASK(LCDDATA25), 7
#define S15C5                            BANKMASK(LCDDATA31), 7
#define S15C6                            BANKMASK(LCDDATA37), 7
#define S15C7                            BANKMASK(LCDDATA43), 7
#define S18C0                            BANKMASK(LCDDATA2), 2
#define S18C1                            BANKMASK(LCDDATA8), 2
#define S18C2                            BANKMASK(LCDDATA14), 2
#define S18C3                            BANKMASK(LCDDATA20), 2
#define S18C4                            BANKMASK(LCDDATA26), 2
#define S18C5                            BANKMASK(LCDDATA32), 2
#define S18C6                            BANKMASK(LCDDATA38), 2
#define S18C7                            BANKMASK(LCDDATA44), 2
#define S19C0                            BANKMASK(LCDDATA2), 3
#define S19C1                            BANKMASK(LCDDATA8), 3
#define S19C2                            BANKMASK(LCDDATA14), 3
#define S19C3                            BANKMASK(LCDDATA20), 3
#define S19C4                            BANKMASK(LCDDATA26), 3
#define S19C5                            BANKMASK(LCDDATA32), 3
#define S19C6                            BANKMASK(LCDDATA38), 3
#define S19C7                            BANKMASK(LCDDATA44), 3
#define S2                               BANKMASK(SSP1STAT), 3
#define S20C0                            BANKMASK(LCDDATA2), 4
#define S20C1                            BANKMASK(LCDDATA8), 4
#define S20C2                            BANKMASK(LCDDATA14), 4
#define S20C3                            BANKMASK(LCDDATA20), 4
#define S20C4                            BANKMASK(LCDDATA26), 4
#define S20C5                            BANKMASK(LCDDATA32), 4
#define S20C6                            BANKMASK(LCDDATA38), 4
#define S20C7                            BANKMASK(LCDDATA44), 4
#define S22C0                            BANKMASK(LCDDATA2), 6
#define S22C1                            BANKMASK(LCDDATA8), 6
#define S22C2                            BANKMASK(LCDDATA14), 6
#define S22C3                            BANKMASK(LCDDATA20), 6
#define S22C4                            BANKMASK(LCDDATA26), 6
#define S22C5                            BANKMASK(LCDDATA32), 6
#define S22C6                            BANKMASK(LCDDATA38), 6
#define S22C7                            BANKMASK(LCDDATA44), 6
#define S23C0                            BANKMASK(LCDDATA2), 7
#define S23C1                            BANKMASK(LCDDATA8), 7
#define S23C2                            BANKMASK(LCDDATA14), 7
#define S23C3                            BANKMASK(LCDDATA20), 7
#define S23C4                            BANKMASK(LCDDATA26), 7
#define S23C5                            BANKMASK(LCDDATA32), 7
#define S23C6                            BANKMASK(LCDDATA38), 7
#define S23C7                            BANKMASK(LCDDATA44), 7
#define S24C0                            BANKMASK(LCDDATA3), 0
#define S24C1                            BANKMASK(LCDDATA9), 0
#define S24C2                            BANKMASK(LCDDATA15), 0
#define S24C3                            BANKMASK(LCDDATA21), 0
#define S24C4                            BANKMASK(LCDDATA27), 0
#define S24C5                            BANKMASK(LCDDATA33), 0
#define S24C6                            BANKMASK(LCDDATA39), 0
#define S24C7                            BANKMASK(LCDDATA45), 0
#define S25C0                            BANKMASK(LCDDATA3), 1
#define S25C1                            BANKMASK(LCDDATA9), 1
#define S25C2                            BANKMASK(LCDDATA15), 1
#define S25C3                            BANKMASK(LCDDATA21), 1
#define S25C4                            BANKMASK(LCDDATA27), 1
#define S25C5                            BANKMASK(LCDDATA33), 1
#define S25C6                            BANKMASK(LCDDATA39), 1
#define S25C7                            BANKMASK(LCDDATA45), 1
#define S26C0                            BANKMASK(LCDDATA3), 2
#define S26C1                            BANKMASK(LCDDATA9), 2
#define S26C2                            BANKMASK(LCDDATA15), 2
#define S26C3                            BANKMASK(LCDDATA21), 2
#define S26C4                            BANKMASK(LCDDATA27), 2
#define S26C5                            BANKMASK(LCDDATA33), 2
#define S26C6                            BANKMASK(LCDDATA39), 2
#define S26C7                            BANKMASK(LCDDATA45), 2
#define S27C0                            BANKMASK(LCDDATA3), 3
#define S27C1                            BANKMASK(LCDDATA9), 3
#define S27C2                            BANKMASK(LCDDATA15), 3
#define S27C3                            BANKMASK(LCDDATA21), 3
#define S27C4                            BANKMASK(LCDDATA27), 3
#define S27C5                            BANKMASK(LCDDATA33), 3
#define S27C6                            BANKMASK(LCDDATA39), 3
#define S27C7                            BANKMASK(LCDDATA45), 3
#define S28C0                            BANKMASK(LCDDATA3), 4
#define S28C1                            BANKMASK(LCDDATA9), 4
#define S28C2                            BANKMASK(LCDDATA15), 4
#define S28C3                            BANKMASK(LCDDATA21), 4
#define S28C4                            BANKMASK(LCDDATA27), 4
#define S28C5                            BANKMASK(LCDDATA33), 4
#define S28C6                            BANKMASK(LCDDATA39), 4
#define S28C7                            BANKMASK(LCDDATA45), 4
#define S29C0                            BANKMASK(LCDDATA3), 5
#define S29C1                            BANKMASK(LCDDATA9), 5
#define S29C2                            BANKMASK(LCDDATA15), 5
#define S29C3                            BANKMASK(LCDDATA21), 5
#define S29C4                            BANKMASK(LCDDATA27), 5
#define S29C5                            BANKMASK(LCDDATA33), 5
#define S29C6                            BANKMASK(LCDDATA39), 5
#define S29C7                            BANKMASK(LCDDATA45), 5
#define S30C0                            BANKMASK(LCDDATA3), 6
#define S30C1                            BANKMASK(LCDDATA9), 6
#define S30C2                            BANKMASK(LCDDATA15), 6
#define S30C3                            BANKMASK(LCDDATA21), 6
#define S30C4                            BANKMASK(LCDDATA27), 6
#define S30C5                            BANKMASK(LCDDATA33), 6
#define S30C6                            BANKMASK(LCDDATA39), 6
#define S30C7                            BANKMASK(LCDDATA45), 6
#define S31C0                            BANKMASK(LCDDATA3), 7
#define S31C1                            BANKMASK(LCDDATA9), 7
#define S31C2                            BANKMASK(LCDDATA15), 7
#define S31C3                            BANKMASK(LCDDATA21), 7
#define S31C4                            BANKMASK(LCDDATA27), 7
#define S31C5                            BANKMASK(LCDDATA33), 7
#define S31C6                            BANKMASK(LCDDATA39), 7
#define S31C7                            BANKMASK(LCDDATA45), 7
#define S32C0                            BANKMASK(LCDDATA4), 0
#define S32C1                            BANKMASK(LCDDATA10), 0
#define S32C2                            BANKMASK(LCDDATA16), 0
#define S32C3                            BANKMASK(LCDDATA22), 0
#define S32C4                            BANKMASK(LCDDATA28), 0
#define S32C5                            BANKMASK(LCDDATA34), 0
#define S32C6                            BANKMASK(LCDDATA40), 0
#define S32C7                            BANKMASK(LCDDATA46), 0
#define S33C0                            BANKMASK(LCDDATA4), 1
#define S33C1                            BANKMASK(LCDDATA10), 1
#define S33C2                            BANKMASK(LCDDATA16), 1
#define S33C3                            BANKMASK(LCDDATA22), 1
#define S33C4                            BANKMASK(LCDDATA28), 1
#define S33C5                            BANKMASK(LCDDATA34), 1
#define S33C6                            BANKMASK(LCDDATA40), 1
#define S33C7                            BANKMASK(LCDDATA46), 1
#define S34C0                            BANKMASK(LCDDATA4), 2
#define S34C1                            BANKMASK(LCDDATA10), 2
#define S34C2                            BANKMASK(LCDDATA16), 2
#define S34C3                            BANKMASK(LCDDATA22), 2
#define S34C4                            BANKMASK(LCDDATA28), 2
#define S34C5                            BANKMASK(LCDDATA34), 2
#define S34C6                            BANKMASK(LCDDATA40), 2
#define S34C7                            BANKMASK(LCDDATA46), 2
#define S40C0                            BANKMASK(LCDDATA5), 0
#define S40C1                            BANKMASK(LCDDATA11), 0
#define S40C2                            BANKMASK(LCDDATA17), 0
#define S40C3                            BANKMASK(LCDDATA23), 0
#define S40C4                            BANKMASK(LCDDATA29), 0
#define S40C5                            BANKMASK(LCDDATA35), 0
#define S40C6                            BANKMASK(LCDDATA41), 0
#define S40C7                            BANKMASK(LCDDATA47), 0
#define S41C0                            BANKMASK(LCDDATA5), 1
#define S41C1                            BANKMASK(LCDDATA11), 1
#define S41C2                            BANKMASK(LCDDATA17), 1
#define S41C3                            BANKMASK(LCDDATA23), 1
#define S41C4                            BANKMASK(LCDDATA29), 1
#define S41C5                            BANKMASK(LCDDATA35), 1
#define S41C6                            BANKMASK(LCDDATA41), 1
#define S41C7                            BANKMASK(LCDDATA47), 1
#define S42C0                            BANKMASK(LCDDATA5), 2
#define S42C1                            BANKMASK(LCDDATA11), 2
#define S42C2                            BANKMASK(LCDDATA17), 2
#define S42C3                            BANKMASK(LCDDATA23), 2
#define S42C4                            BANKMASK(LCDDATA29), 2
#define S42C5                            BANKMASK(LCDDATA35), 2
#define S42C6                            BANKMASK(LCDDATA41), 2
#define S42C7                            BANKMASK(LCDDATA47), 2
#define S43C0                            BANKMASK(LCDDATA5), 3
#define S43C1                            BANKMASK(LCDDATA11), 3
#define S43C2                            BANKMASK(LCDDATA17), 3
#define S43C3                            BANKMASK(LCDDATA23), 3
#define S43C4                            BANKMASK(LCDDATA29), 3
#define S43C5                            BANKMASK(LCDDATA35), 3
#define S43C6                            BANKMASK(LCDDATA41), 3
#define S43C7                            BANKMASK(LCDDATA47), 3
#define S44C0                            BANKMASK(LCDDATA5), 4
#define S44C1                            BANKMASK(LCDDATA11), 4
#define S44C2                            BANKMASK(LCDDATA17), 4
#define S44C3                            BANKMASK(LCDDATA23), 4
#define S44C4                            BANKMASK(LCDDATA29), 4
#define S44C5                            BANKMASK(LCDDATA35), 4
#define S44C6                            BANKMASK(LCDDATA41), 4
#define S44C7                            BANKMASK(LCDDATA47), 4
#define S45C0                            BANKMASK(LCDDATA5), 5
#define S45C1                            BANKMASK(LCDDATA11), 5
#define S45C2                            BANKMASK(LCDDATA17), 5
#define S45C3                            BANKMASK(LCDDATA23), 5
#define S45C4                            BANKMASK(LCDDATA29), 5
#define S45C5                            BANKMASK(LCDDATA35), 5
#define S45C6                            BANKMASK(LCDDATA41), 5
#define S45C7                            BANKMASK(LCDDATA47), 5
#define S46C0                            BANKMASK(LCDDATA5), 6
#define S46C1                            BANKMASK(LCDDATA11), 6
#define S46C2                            BANKMASK(LCDDATA17), 6
#define S46C3                            BANKMASK(LCDDATA23), 6
#define S46C4                            BANKMASK(LCDDATA29), 6
#define S46C5                            BANKMASK(LCDDATA35), 6
#define S46C6                            BANKMASK(LCDDATA41), 6
#define S46C7                            BANKMASK(LCDDATA47), 6
#define S47C0                            BANKMASK(LCDDATA5), 7
#define S47C1                            BANKMASK(LCDDATA11), 7
#define S47C2                            BANKMASK(LCDDATA17), 7
#define S47C3                            BANKMASK(LCDDATA23), 7
#define S47C4                            BANKMASK(LCDDATA29), 7
#define S47C5                            BANKMASK(LCDDATA35), 7
#define S47C6                            BANKMASK(LCDDATA41), 7
#define S47C7                            BANKMASK(LCDDATA47), 7
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SE00                             BANKMASK(LCDSE0), 0
#define SE01                             BANKMASK(LCDSE0), 1
#define SE02                             BANKMASK(LCDSE0), 2
#define SE03                             BANKMASK(LCDSE0), 3
#define SE04                             BANKMASK(LCDSE0), 4
#define SE05                             BANKMASK(LCDSE0), 5
#define SE06                             BANKMASK(LCDSE0), 6
#define SE07                             BANKMASK(LCDSE0), 7
#define SE08                             BANKMASK(LCDSE1), 0
#define SE09                             BANKMASK(LCDSE1), 1
#define SE10                             BANKMASK(LCDSE1), 2
#define SE11                             BANKMASK(LCDSE1), 3
#define SE12                             BANKMASK(LCDSE1), 4
#define SE13                             BANKMASK(LCDSE1), 5
#define SE14                             BANKMASK(LCDSE1), 6
#define SE15                             BANKMASK(LCDSE1), 7
#define SE16                             BANKMASK(LCDSE2), 0
#define SE17                             BANKMASK(LCDSE2), 1
#define SE18                             BANKMASK(LCDSE2), 2
#define SE19                             BANKMASK(LCDSE2), 3
#define SE20                             BANKMASK(LCDSE2), 4
#define SE21                             BANKMASK(LCDSE2), 5
#define SE22                             BANKMASK(LCDSE2), 6
#define SE23                             BANKMASK(LCDSE2), 7
#define SE24                             BANKMASK(LCDSE3), 0
#define SE25                             BANKMASK(LCDSE3), 1
#define SE26                             BANKMASK(LCDSE3), 2
#define SE27                             BANKMASK(LCDSE3), 3
#define SE28                             BANKMASK(LCDSE3), 4
#define SE29                             BANKMASK(LCDSE3), 5
#define SE30                             BANKMASK(LCDSE3), 6
#define SE31                             BANKMASK(LCDSE3), 7
#define SE32                             BANKMASK(LCDSE4), 0
#define SE33                             BANKMASK(LCDSE4), 1
#define SE34                             BANKMASK(LCDSE4), 2
#define SE35                             BANKMASK(LCDSE4), 3
#define SE36                             BANKMASK(LCDSE4), 4
#define SE37                             BANKMASK(LCDSE4), 5
#define SE38                             BANKMASK(LCDSE4), 6
#define SE39                             BANKMASK(LCDSE4), 7
#define SE40                             BANKMASK(LCDSE5), 0
#define SE41                             BANKMASK(LCDSE5), 1
#define SE42                             BANKMASK(LCDSE5), 2
#define SE43                             BANKMASK(LCDSE5), 3
#define SE44                             BANKMASK(LCDSE5), 4
#define SE45                             BANKMASK(LCDSE5), 5
#define SE46                             BANKMASK(LCDSE5), 6
#define SE47                             BANKMASK(LCDSE5), 7
#define SECH0                            BANKMASK(SECONDS), 4
#define SECH1                            BANKMASK(SECONDS), 5
#define SECH2                            BANKMASK(SECONDS), 6
#define SECL0                            BANKMASK(SECONDS), 0
#define SECL1                            BANKMASK(SECONDS), 1
#define SECL2                            BANKMASK(SECONDS), 2
#define SECL3                            BANKMASK(SECONDS), 3
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLPEN                            BANKMASK(LCDCON), 6
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SLRD0                            BANKMASK(SLRCOND), 0
#define SLRD1                            BANKMASK(SLRCOND), 1
#define SLRD2                            BANKMASK(SLRCOND), 2
#define SLRD3                            BANKMASK(SLRCOND), 3
#define SLRD4                            BANKMASK(SLRCOND), 4
#define SLRD5                            BANKMASK(SLRCOND), 5
#define SLRD6                            BANKMASK(SLRCOND), 6
#define SLRD7                            BANKMASK(SLRCOND), 7
#define SLRE0                            BANKMASK(SLRCONE), 0
#define SLRE1                            BANKMASK(SLRCONE), 1
#define SLRE2                            BANKMASK(SLRCONE), 2
#define SLRF0                            BANKMASK(SLRCONF), 0
#define SLRF1                            BANKMASK(SLRCONF), 1
#define SLRF2                            BANKMASK(SLRCONF), 2
#define SLRF3                            BANKMASK(SLRCONF), 3
#define SLRF4                            BANKMASK(SLRCONF), 4
#define SLRF5                            BANKMASK(SLRCONF), 5
#define SLRF6                            BANKMASK(SLRCONF), 6
#define SLRF7                            BANKMASK(SLRCONF), 7
#define SMP                              BANKMASK(SSP1STAT), 7
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMT1AS                           BANKMASK(SMT1STAT), 0
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2
#define SMT1EN                           BANKMASK(SMT1CON0), 7
#define SMT1GO                           BANKMASK(SMT1CON1), 7
#define SMT1IE                           BANKMASK(PIE8), 0
#define SMT1IF                           BANKMASK(PIR8), 0
#define SMT1MD                           BANKMASK(PMD5), 6
#define SMT1PR0                          BANKMASK(SMT1PRL), 0
#define SMT1PR1                          BANKMASK(SMT1PRL), 1
#define SMT1PR10                         BANKMASK(SMT1PRH), 2
#define SMT1PR11                         BANKMASK(SMT1PRH), 3
#define SMT1PR12                         BANKMASK(SMT1PRH), 4
